Results/All/data/swarm-sn-wrk-mixed-c6525-25g-exp7-havail0-hori1-verti1-infi1-client1-t4-c512-d30-R1500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://10.10.1.6:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 1.752ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.737ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.744ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.695ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.52ms    1.46ms   5.68ms   60.83%
    Req/Sec   393.24    205.97     0.90k    76.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.80ms
 75.000%    3.73ms
 90.000%    4.24ms
 99.000%    5.68ms
 99.900%    7.24ms
 99.990%    8.63ms
 99.999%    9.16ms
100.000%    9.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.448     0.000000            1         1.00
       0.722     0.100000         2967         1.11
       1.013     0.200000         5944         1.25
       1.178     0.300000         8912         1.43
       1.432     0.400000        11869         1.67
       2.799     0.500000        14839         2.00
       3.135     0.550000        16323         2.22
       3.357     0.600000        17810         2.50
       3.505     0.650000        19304         2.86
       3.623     0.700000        20777         3.33
       3.735     0.750000        22254         4.00
       3.793     0.775000        22998         4.44
       3.859     0.800000        23743         5.00
       3.931     0.825000        24490         5.71
       4.011     0.850000        25227         6.67
       4.111     0.875000        25965         8.00
       4.175     0.887500        26349         8.89
       4.239     0.900000        26716        10.00
       4.311     0.912500        27080        11.43
       4.399     0.925000        27451        13.33
       4.511     0.937500        27816        16.00
       4.571     0.943750        28006        17.78
       4.643     0.950000        28197        20.00
       4.727     0.956250        28374        22.86
       4.819     0.962500        28557        26.67
       4.939     0.968750        28742        32.00
       4.999     0.971875        28835        35.56
       5.079     0.975000        28929        40.00
       5.183     0.978125        29025        45.71
       5.295     0.981250        29121        53.33
       5.403     0.984375        29209        64.00
       5.463     0.985938        29252        71.11
       5.539     0.987500        29302        80.00
       5.631     0.989062        29347        91.43
       5.731     0.990625        29391       106.67
       5.895     0.992188        29438       128.00
       5.935     0.992969        29462       142.22
       6.019     0.993750        29485       160.00
       6.107     0.994531        29507       182.86
       6.219     0.995313        29531       213.33
       6.347     0.996094        29554       256.00
       6.395     0.996484        29565       284.44
       6.507     0.996875        29577       320.00
       6.567     0.997266        29588       365.71
       6.667     0.997656        29600       426.67
       6.827     0.998047        29612       512.00
       6.899     0.998242        29617       568.89
       6.967     0.998437        29623       640.00
       7.067     0.998633        29629       731.43
       7.183     0.998828        29636       853.33
       7.263     0.999023        29641      1024.00
       7.291     0.999121        29644      1137.78
       7.391     0.999219        29646      1280.00
       7.503     0.999316        29649      1462.86
       7.567     0.999414        29652      1706.67
       7.779     0.999512        29655      2048.00
       7.803     0.999561        29656      2275.56
       7.911     0.999609        29658      2560.00
       8.023     0.999658        29659      2925.71
       8.131     0.999707        29661      3413.33
       8.199     0.999756        29662      4096.00
       8.215     0.999780        29663      4551.11
       8.303     0.999805        29664      5120.00
       8.303     0.999829        29664      5851.43
       8.439     0.999854        29665      6826.67
       8.631     0.999878        29666      8192.00
       8.631     0.999890        29666      9102.22
       8.647     0.999902        29667     10240.00
       8.647     0.999915        29667     11702.86
       8.647     0.999927        29667     13653.33
       9.071     0.999939        29668     16384.00
       9.071     0.999945        29668     18204.44
       9.071     0.999951        29668     20480.00
       9.071     0.999957        29668     23405.71
       9.071     0.999963        29668     27306.67
       9.159     0.999969        29669     32768.00
       9.159     1.000000        29669          inf
#[Mean    =        2.524, StdDeviation   =        1.456]
#[Max     =        9.152, Total count    =        29669]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44705 requests in 30.01s, 216.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:   1489.88
Transfer/sec:      7.22MB